Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.3.139/atdf/ATSAML11D16A.atdf
        <register name="FP_DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FPB Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="FP_PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="FP_PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 5">
        </register>
        <register name="FP_PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 6">
        </register>
        <register name="FP_PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 7">
        </register>
        <register name="FP_PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="FP_PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="FP_PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="FP_PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="FP_CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="FP Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="FP_CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="FP Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="FP_CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="FP Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="FP_CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="FP Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="FPB_FP_LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="ICB" version="1.0.0" caption="Implementation Control Block">
      <register-group name="ICB" caption="Implementation Control Block">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="Interrupt line set number" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
        </register>
      </register-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="MPU_TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instructions and data address regions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of MPU data regions" mask="0xFF00"/>
        </register>
        <register name="MPU_CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="HardFault, NMI enable" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Privileged default enable" mask="0x4"/>
        </register>
        <register name="MPU_RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Selected region number" mask="0xFF"/>
        </register>
        <register name="MPU_RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="MPU_RBAR__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="MPU_RBAR__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="MPU_RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Limit Address Register">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
